src/Documents/ЗапросыНаАкцептИБ/ЗапросыНаАкцептИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросыНаАкцептИБ</name>
  <attributes>
    <name>ИдентификаторИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелоЗапроса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.СтатусыОбработкиЗапросовНаАкцепт</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринялРешение</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/СтатусыОбработкиЗапросовНаАкцепт/СтатусыОбработкиЗапросовНаАкцепт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбработкиЗапросовНаАкцепт</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Принят</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗапросыНаАкцептИБ/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ПометкаУдаления И СтатусОбработки = Перечисления.СтатусыОбработкиЗапросовНаАкцепт.Принят Тогда
		
		СсылкаИБ = ИнформационныеБазы.НайтиЭлементПоИдентификатору(ИдентификаторИБ);
		
		Если СсылкаИБ.ПометкаУдаления Тогда
			
			ОбъектИБ = СсылкаИБ.ПолучитьОбъект();
			ОбъектИБ.УстановитьПометкуУдаления(Ложь);
			
		КонецЕсли;
		
	ИначеЕсли ПометкаУдаления И ЗначениеЗаполнено(ИнформационнаяБаза)
		И ОбщегоНазначения.СсылкаСуществует(ИнформационнаяБаза) Тогда
		
		ОбъектИБ = ИнформационнаяБаза.ПолучитьОбъект();
		ОбъектИБ.УстановитьПометкуУдаления(Истина);
		
	КонецЕсли;
	
КонецПроцедуры
